var fabricImg = {
    "Химзавод": {
        "style": "CP1"
    },
    "Нефтеперабатывающийзавод": {
        "style": "O1"
    },
    "Сборочнаямашина1": {
        "style": "A1"
    },
    "Сборочнаямашина2": {
        "style": "A2"
    },
    "Сборочнаямашина3": {
        "style": "A3"
    },
    "Каменнаяпечь": {
        "style": "F1"
    },
    "Стальнаяпечь": {
        "style": "F2"
    },
    "Электропечь": {
        "style": "F3"
    },
    "O": {
        "style": "A1"
    },
    "Нефтекачка": {
        "style": "P1"
    },
    "Водянойнасос": {
        "style": "W1"
    },
    "Электрическийбур": {
        "style": "E1"
    },
    "Лаборатория": {
        "style": "L1"
    },

};

var fi = {
    "Сера": {
        "img": "images/Sulfur.png",
        "host": "http://wiki.factorio.com/"
    },
    "Сернаякислота": {
        "img": "images/Sulfuric-acid.png",
        "host": "http://wiki.factorio.com/"
    },
    "Твердоетопливо": {
        "img": "images/Stone-brick.png",
        "host": "http://wiki.factorio.com/"
    },
    "Лубрикант": {
        "img": "images/Lubricant.png",
        "host": "http://wiki.factorio.com/"
    },
    "Пластик": {
        "img": "images/Plastic-bar.png",
        "host": "http://wiki.factorio.com/"
    },
    "Батарейка": {
        "img": "images/Battery.png",
        "host": "http://wiki.factorio.com/"
    },
    "Железо": {
        "img": "images/Iron-plate.png",
        "host": "http://wiki.factorio.com/"
    },
    "Сталь": {
        "img": "images/Steel-bar.png",
        "host": "http://wiki.factorio.com/"
    },
    "Медь": {
        "img": "images/Copper-plate.png",
        "host": "http://wiki.factorio.com/"
    },
    "Кирпич": {
        "img": "images/Stone-brick.png",
        "host": "http://wiki.factorio.com/"
    },
    "Медныйпровод": {
        "img": "images/Copper-cable.png",
        "host": "http://wiki.factorio.com/"
    },
    "Зеленаяплата": {
        "img": "images/Electronic-circuit.png",
        "host": "http://wiki.factorio.com/"
    },
    "Краснаяпалта": {
        "img": "images/Advanced-circuit.png",
        "host": "http://wiki.factorio.com/"
    },
    "Фиолетоваяплата": {
        "img": "images/Processing-unit.png",
        "host": "http://wiki.factorio.com/"
    },
    "Желтаялента": {
        "img": "icons/transport-belt.png",
        "host": window.location.href
    },
    "К.трансп.Лента": {
        "img": "images/Sulfur.png",
        "host": "http://wiki.factorio.com/"
    },
    "С.трансп.лента": {
        "img": "images/Sulfur.png",
        "host": "http://wiki.factorio.com/"
    },
    "Ж.разделитель": {
        "img": "images/Sulfur.png",
        "host": "http://wiki.factorio.com/"
    },
    "К.разделитель": {
        "img": "images/Sulfur.png",
        "host": "http://wiki.factorio.com/"
    },
    "Ж.подз.лента": {
        "img": "images/Sulfur.png",
        "host": "http://wiki.factorio.com/"
    },
    "К.подз.лента": {
        "img": "images/Sulfur.png",
        "host": "http://wiki.factorio.com/"
    },
    "Топливный": {
        "img": "images/Burner-inserter.png",
        "host": "http://wiki.factorio.com/"
    },
    "Электрический": {
        "img": "images/Inserter-icon.png",
        "host": "http://wiki.factorio.com/"
    },
    "Длинный": {
        "img": "images/Long-handed-inserter.png",
        "host": "http://wiki.factorio.com/"
    },
    "Быстрый": {
        "img": "images/Fast-inserter.png",
        "host": "http://wiki.factorio.com/"
    },
    "Фильтрующий": {
        "img": "images/Smart-inserter.png",
        "host": "http://wiki.factorio.com/"
    },
    "Стековый": {
        "img": "images/Sulfur.png",
        "host": "http://wiki.factorio.com/"
    },
    "Стековыйфильтр": {
        "img": "images/Sulfur.png",
        "host": "http://wiki.factorio.com/"
    },
    "Краснаяколба": {
        "img": "icons/science-pack-1.png",
        "host": window.location.href
    },
    "Зелёнаяколба": {
        "img": "icons/science-pack-2.png",
        "host": window.location.href
    },
    "Синяяколба": {
        "img": "icons/science-pack-3.png",
        "host": window.location.href
    },
    "Фиолетоваяколба": {
        "img": "icons/alien-science-pack.png",
        "host": window.location.href
    },
    /*"Артефакт": {
        "img": "icons/alien-artifact.png",
        "host": window.location.href
    },*/

    "Исследование": {
        "img": "icons/lab.png",
        "host": window.location.href
    },
    "Тяжелаянефть": {
        "img": "icons/fluid/heavy-oil.png",
        "host": window.location.href
    },
    "Легкаянефть": {
        "img": "icons/fluid/light-oil.png",
        "host": window.location.href
    },
    "Газ": {
        "img": "icons/fluid/petroleum-gas.png",
        "host": window.location.href
    },
    "Шестерня": {
        "img": "images/Iron-gear-wheel.png",
        "host": "http://wiki.factorio.com/"
    },
    "Сыраянефть": {
        "img": "images/Crude-oil.png",
        "host": "http://wiki.factorio.com/"
    },
    "Вода": {
        "img": "icons/fluid/water.png",
        "host": window.location.href
    },
    "Железнаяруда": {
        "img": "icons/iron-ore.png",
        "host": window.location.href
    },
    "Меднаяруда": {
        "img": "icons/copper-ore.png",
        "host": window.location.href
    },
    "Каменнаяруда": {
        "img": "icons/stone.png",
        "host": window.location.href
    },
    "Уголь": {
        "img": "icons/coal.png",
        "host": window.location.href
    },
    "O": {
        "img": "images/Iron-gear-wheel.png",
        "host": window.location.href
    }
};

var fcr = {
    "Вода": [
        {
            "Fabric": "Водянойнасос",
            "Out": 6,
            "Time": 1,
            "Items": {}
        }
    ],
    "Сыраянефть": [
        {
            "Fabric": "Нефтекачка",
            "Out": 1,
            "Time": 1,
            "Items": {}
        }
    ],
    "Железнаяруда": [
        {
            "Fabric": "Электрическийбур",
            "Out": 1,
            "Time": 2,
            "Items": {}
        }
    ],
    "Меднаяруда": [
        {
            "Fabric": "Электрическийбур",
            "Out": 1,
            "Time": 2,
            "Items": {}
        }
    ],
    "Каменнаяруда": [
        {
            "Fabric": "Электрическийбур",
            "Out": 1,
            "Time": 2,
            "Items": {}
        }
    ],
    "Уголь": [
        {
            "Fabric": "Электрическийбур",
            "Out": 1,
            "Time": 2,
            "Items": {}
        }
    ],

    "Сера": [
        {
            "Fabric": "Химзавод",
            "Out": 2,
            "Time": 1,
            "Items": {
                "Газ": 3,
                "Вода": 3
            }
        }
    ],
    "Сернаякислота": [
        {
            "Fabric": "Химзавод",
            "Out": 5,
            "Time": 1,
            "Items": {
                "Сера": 5,
                "Железо": 1,
                "Вода": 10
            }
        }
    ],
    "Твердоетопливо": [
        {
            "Fabric": "Химзавод",
            "Out": 1,
            "Time": 3,
            "Items": {
                "Легкаянефть": 1
            }
        }, {
            "Fabric": "Химзавод",
            "Out": 1,
            "Time": 3,
            "Items": {
                "Газ": 2
            }
        }, {
            "Fabric": "Химзавод",
            "Out": 1,
            "Time": 3,
            "Items": {
                "Тяжелаянефть": 2
            }
        }
    ],
    "Лубрикант": [
        {
            "Fabric": "Химзавод",
            "Out": 1,
            "Time": 1,
            "Items": {
                "Тяжелаянефть": 1
            }
        }
    ],
    "Пластик": [
        {
            "Fabric": "Химзавод",
            "Out": 2,
            "Time": 1,
            "Items": {
                "Уголь": 1,
                "Газ": 3
            }
        }
    ],
    "Батарейка": [
        {
            "Fabric": "Химзавод",
            "Out": 1,
            "Time": 5,
            "Items": {
                "Железо": 1,
                "Медь": 1,
                "Сернаякислота": 2
            }
        }
    ],
    "Железо": [
        {
            "Fabric": "Каменнаяпечь",
            "Out": 1,
            "Time": 3.5,
            "Items": {
                "Железнаяруда": 1,
                "Топливо": 0
            }
        }, {
            "Fabric": "Стальнаяпечь",
            "Out": 1,
            "Time": 1.75,
            "Items": {
                "Железнаяруда": 1,
                "Топливо": 0
            }
        }, {
            "Fabric": "Электропечь",
            "Out": 1,
            "Time": 1.75,
            "Items": {
                "Железнаяруда": 1,
                "Энергия": 0
            }
        }
    ],
    "Сталь": [
        {
            "Fabric": "Каменнаяпечь",
            "Out": 1,
            "Time": 17.5,
            "Items": {
                "Железо": 5,
                "Топливо": 0
            }
        }, {
            "Fabric": "Стальнаяпечь",
            "Out": 1,
            "Time": 5.83,
            "Items": {
                "Железо": 5,
                "Топливо": 0
            }
        }, {
            "Fabric": "Электропечь",
            "Out": 1,
            "Time": 5.83,
            "Items": {
                "Железо": 5,
                "Энергия": 0
            }
        }
    ],
    "Медь": [
        {
            "Fabric": "Каменнаяпечь",
            "Out": 1,
            "Time": 3.5,
            "Items": {
                "Меднаяруда": 1,
                "Топливо": 0
            }
        }, {
            "Fabric": "Стальнаяпечь",
            "Out": 1,
            "Time": 1.17,
            "Items": {
                "Меднаяруда": 1,
                "Топливо": 0
            }
        }, {
            "Fabric": "Электропечь",
            "Out": 1,
            "Time": 1.17,
            "Items": {
                "Меднаяруда": 1,
                "Топливо": 0
            }
        }
    ],
    "Кирпич": [
        {
            "Fabric": "Каменнаяпечь",
            "Out": 1,
            "Time": 3.5,
            "Items": {
                "Каменнаяруда": 1,
                "Топливо": 0
            }
        }, {
            "Fabric": "Стальнаяпечь",
            "Out": 1,
            "Time": 1.17,
            "Items": {
                "Каменнаяруда": 1,
                "Топливо": 0
            }
        }, {
            "Fabric": "Электропечь",
            "Out": 1,
            "Time": 1.17,
            "Items": {
                "Каменнаяруда": 1,
                "Энергия": 0
            }
        }
    ],
    "Медныйпровод": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 1,
            "Items": {
                "Медь": 1
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 0.67,
            "Items": {
                "Медь": 1
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 0.4,
            "Items": {
                "Медь": 1
            }
        }
    ],
    "Зеленаяплата": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 1,
            "Items": {
                "Медныйпровод": 3,
                "Железо": 1
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 1.33,
            "Items": {
                "Медныйпровод": 3,
                "Железо": 1
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 0.8,
            "Items": {
                "Медныйпровод": 3,
                "Железо": 1
            }
        }
    ],
    "Краснаяпалта": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 16,
            "Items": {
                "Зеленаяплата": 2,
                "Пластик": 2,
                "Медныйпровод": 4
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 10.67,
            "Items": {
                "Зеленаяплата": 2,
                "Пластик": 2,
                "Медныйпровод": 4
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 6.4,
            "Items": {
                "Зеленаяплата": 2,
                "Пластик": 2,
                "Медныйпровод": 4
            }
        }
    ],
    "Фиолетоваяплата": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 30,
            "Items": {
                "Зеленаяплата": 20,
                "Краснаяплата": 2,
                "Сернаякислота": 0.5
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 20,
            "Items": {
                "Зеленаяплата": 20,
                "Краснаяплата": 2,
                "Сернаякислота": 0.5
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 12,
            "Items": {
                "Зеленаяплата": 20,
                "Краснаяплата": 2,
                "Сернаякислота": 0.5
            }
        }
    ],
    "Желтаялента": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 2,
            "Time": 1,
            "Items": {
                "Железо": 1,
                "Шестерня": 1
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 2,
            "Time": 0.67,
            "Items": {
                "Железо": 1,
                "Шестерня": 1
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 2,
            "Time": 0.4,
            "Items": {
                "Железо": 1,
                "Шестерня": 1
            }
        }
    ],
    "К.трансп.Лента": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 1,
            "Items": {
                "Жтрансп.Лента": 1,
                "Шестерня": 5
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 0.67,
            "Items": {
                "Жтрансп.Лента": 1,
                "Шестерня": 5
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 0.4,
            "Items": {
                "Жтрансп.Лента": 1,
                "Шестерня": 5
            }
        }
    ],
    "С.трансп.лента": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 0,
            "Items": {
                "Шестерня": 5,
                "К.трансп.Лента": 1,
                "Лубрикант": 2
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 0.67,
            "Items": {
                "Шестерня": 5,
                "К.трансп.Лента": 1,
                "Лубрикант": 2
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 0.4,
            "Items": {
                "Шестерня": 5,
                "К.трансп.Лента": 1,
                "Лубрикант": 2
            }
        }
    ],
    "Ж.разделитель": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 2,
            "Items": {
                "Зелеанаяплата": 5,
                "Железо": 5,
                "Ж.транп.Лента": 4
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 1.33,
            "Items": {
                "Зелеанаяплата": 5,
                "Железо": 5,
                "Ж.транп.Лента": 4
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 0.8,
            "Items": {
                "Зелеанаяплата": 5,
                "Железо": 5,
                "Ж.транп.Лента": 4
            }
        }
    ],
    "К.разделитель": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 4,
            "Items": {
                "Ж.разделитель": 1,
                "Шестерня": 10,
                "Зеленаяплата": 10
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 2.67,
            "Items": {
                "Ж.разделитель": 1,
                "Шестерня": 10,
                "Зеленаяплата": 10
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 1.6,
            "Items": {
                "Ж.разделитель": 1,
                "Шестерня": 10,
                "Зеленаяплата": 10
            }
        }
    ],
    "Ж.подз.лента": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 2,
            "Time": 0,
            "Items": {
                "Железо": 10,
                "Ж.трансп.лента": 5
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 2,
            "Time": 1.33,
            "Items": {
                "Железо": 10,
                "Ж.трансп.лента": 5
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 2,
            "Time": 0.8,
            "Items": {
                "Железо": 10,
                "Ж.трансп.лента": 5
            }
        }
    ],
    "К.подз.лента": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 2,
            "Time": 1,
            "Items": {
                "Ж.подз.Лента": 2,
                "Шестерня": 20
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 2,
            "Time": 0.67,
            "Items": {
                "Ж.подз.Лента": 2,
                "Шестерня": 20
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 2,
            "Time": 0.4,
            "Items": {
                "Ж.подз.Лента": 2,
                "Шестерня": 20
            }
        }
    ],
    "Топливный": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 1,
            "Items": {
                "Железо": 1,
                "Шестерня": 1
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 0.67,
            "Items": {
                "Железо": 1,
                "Шестерня": 1
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 0.4,
            "Items": {
                "Железо": 1,
                "Шестерня": 1
            }
        }
    ],
    "Электрический": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 0,
            "Items": {
                "Зеленаяплата": 1,
                "Шестерня": 1,
                "Железо": 1
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 0.67,
            "Items": {
                "Зеленаяплата": 1,
                "Шестерня": 1,
                "Железо": 1
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 0.4,
            "Items": {
                "Зеленаяплата": 1,
                "Шестерня": 1,
                "Железо": 1
            }
        }
    ],
    "Длинный": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 0,
            "Items": {
                "Шестерня": 1,
                "Железо": 1,
                "Электрический": 1
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 0.67,
            "Items": {
                "Шестерня": 1,
                "Железо": 1,
                "Электрический": 1
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 0.4,
            "Items": {
                "Шестерня": 1,
                "Железо": 1,
                "Электрический": 1
            }
        }
    ],
    "Быстрый": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 0,
            "Items": {
                "Зеленаяплата": 2,
                "Железо": 2,
                "Электрический": 1
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 0.67,
            "Items": {
                "Зеленаяплата": 2,
                "Железо": 2,
                "Электрический": 1
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 0.4,
            "Items": {
                "Зеленаяплата": 2,
                "Железо": 2,
                "Электрический": 1
            }
        }
    ],
    "Фильтрующий": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 1,
            "Items": {
                "Быстрый": 1,
                "Зеленаяплата": 4
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 0.67,
            "Items": {
                "Быстрый": 1,
                "Зеленаяплата": 4
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 0.4,
            "Items": {
                "Быстрый": 1,
                "Зеленаяплата": 4
            }
        }
    ],
    "Стековый": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 0,
            "Items": {
                "Шестерня": 15,
                "Зеленаяплата": 15,
                "Краснаяплата": 1,
                "Быстрый": 1
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 0.67,
            "Items": {
                "Шестерня": 15,
                "Зеленаяплата": 15,
                "Краснаяплата": 1,
                "Быстрый": 1
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 0.4,
            "Items": {
                "Шестерня": 15,
                "Зеленаяплата": 15,
                "Краснаяплата": 1,
                "Быстрый": 1
            }
        }
    ],
    "Стековыйфильтр": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 1,
            "Items": {
                "Стековый": 1,
                "Зеленаяплата": 5
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 0.67,
            "Items": {
                "Стековый": 1,
                "Зеленаяплата": 5
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 0.4,
            "Items": {
                "Стековый": 1,
                "Зеленаяплата": 5
            }
        }
    ],
    "Зелёнаяколба": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 10,
            "Items": {
                "Медь": 1,
                "Шестерня": 1
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 6.67,
            "Items": {
                "Медь": 1,
                "Шестерня": 1
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 4,
            "Items": {
                "Медь": 1,
                "Шестерня": 1
            }
        }],
        "Краснаяколба": [{
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 12,
            "Items": {
                "Эл.Инсёртер": 1,
                "Желтаялента": 1
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 8,
            "Items": {
                "Эл.Инсёртер": 1,
                "Желтаялента": 1
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 4.8,
            "Items": {
                "Эл.Инсёртер": 1,
                "Желтаялента": 1
            }
        }
    ],
    "Синяяколба": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 0,
            "Items": {
                "Батарея": 1,
                "Краснаяплата": 1,
                "Фильтринсёртер": 1,
                "Сталь": 1
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 16,
            "Items": {
                "Батарея": 1,
                "Краснаяплата": 1,
                "Фильтринсёртер": 1,
                "Сталь": 1
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 9.6,
            "Items": {
                "Батарея": 1,
                "Краснаяплата": 1,
                "Фильтринсёртер": 1,
                "Сталь": 1
            }
        }
    ],
    "Фиолетоваяколба": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 10,
            "Time": 24,
            "Items": {
                /*"Артефакт": 1*/
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 10,
            "Time": 16,
            "Items": {
                "Артефакт": 1
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 10,
            "Time": 9.6,
            "Items": {
                "Артефакт": 1
            }
        }
    ],
    "Исследование": [
        {
            "Fabric": "Лаборатория",
            "Out": 1,
            "Time": 30,
            "Items": {
                "Краснаяколба": 1,
                "Зелёнаяколба": 1,
                "Синяяколба": 1,
                "Фиолетоваяколба": 1
            }
        }
    ],
    "Тяжелаянефть": [
        {
            "Fabric": "Нефтеперабатывающийзавод",
            "Out": 3,
            "Time": 5,
            "Items": {
                "Сыраянефть": 10
            }
        }, {
            "Fabric": "Нефтеперабатывающийзавод",
            "Out": 1,
            "Time": 5,
            "Items": {
                "Сыраянефть": 10,
                "Вода": 5
            }
        }
    ],
    "Легкаянефть": [
        {
            "Fabric": "Нефтеперабатывающийзавод",
            "Out": 3,
            "Time": 5,
            "Items": {
                "Сыраянефть": 10
            }
        }, {
            "Fabric": "Нефтеперабатывающийзавод",
            "Out": 4.5,
            "Time": 5,
            "Items": {
                "Сыраянефть": 10,
                "Вода": 5
            }
        }, {
            "Fabric": "Химзавод",
            "Out": 3,
            "Time": 5,
            "Items": {
                "Тяжелаянефть": 4,
                "Вода": 3
            }
        }
    ],
    "Газ": [
        {
            "Fabric": "Нефтеперабатывающийзавод",
            "Out": 4,
            "Time": 5,
            "Items": {
                "Сыраянефть": 10
            }
        }, {
            "Fabric": "Нефтеперабатывающийзавод",
            "Out": 5.5,
            "Time": 5,
            "Items": {
                "Сыраянефть": 10,
                "Вода": 5
            }
        }, {
            "Fabric": "Химзавод",
            "Out": 2,
            "Time": 5,
            "Items": {
                "Легкаянефть": 3,
                "Вода": 3
            }
        }
    ],
    "Шестерня": [
        {
            "Fabric": "Сборочнаямашина1",
            "Out": 1,
            "Time": 1,
            "Items": {
                "Железо": 1
            }
        }, {
            "Fabric": "Сборочнаямашина2",
            "Out": 1,
            "Time": 0.67,
            "Items": {
                "Железо": 1
            }
        }, {
            "Fabric": "Сборочнаямашина3",
            "Out": 1,
            "Time": 0.4,
            "Items": {
                "Железо": 1
            }
        }
    ]
};
